In [11]:
import pandas as pd
tips_data=pd.read_csv("tips.csv")

In [12]:
tips_data.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'meal', 'party size'], dtype='object')

In [13]:
renamed_tips_data=tips_data.rename({'time':'meal' , 'size': 'party size' },axis=1)
renamed_tips_data.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'meal', 'party size'], dtype='object')

In [14]:
renamed_tips_data.head()

   total_bill   tip     sex smoker  day    meal  party size
0       16.99  1.01  Female     No  Sun  Dinner           2
1       10.34  1.66    Male     No  Sun  Dinner           3
2       21.01  3.50    Male     No  Sun  Dinner           3
3       23.68  3.31    Male     No  Sun  Dinner           2
4       24.59  3.61  Female     No  Sun  Dinner           4

In [17]:
renamed_tips_data.iloc[1:3]

   total_bill   tip   sex smoker  day    meal  party size
1       10.34  1.66  Male     No  Sun  Dinner           3
2       21.01  3.50  Male     No  Sun  Dinner           3

In [18]:
renamed_tips_data[1:3]

   total_bill   tip   sex smoker  day    meal  party size
1       10.34  1.66  Male     No  Sun  Dinner           3
2       21.01  3.50  Male     No  Sun  Dinner           3

In [20]:
renamed_tips_data[['total_bill','tip']].head(3)

   total_bill   tip
0       16.99  1.01
1       10.34  1.66
2       21.01  3.50

In [27]:
renamed_tips_data.iloc[1,[2]]

sex    Male
Name: 1, dtype: object

In [26]:
len(renamed_tips_data.index)

244

In [21]:
renamed_tips_data.describe()

       total_bill         tip  party size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [22]:
renamed_tips_data.describe(include="all")

        total_bill         tip   sex smoker  day    meal  party size
count   244.000000  244.000000   244    244  244     244  244.000000
unique         NaN         NaN     2      2    4       2         NaN
top            NaN         NaN  Male     No  Sat  Dinner         NaN
freq           NaN         NaN   157    151   87     176         NaN
mean     19.785943    2.998279   NaN    NaN  NaN     NaN    2.569672
std       8.902412    1.383638   NaN    NaN  NaN     NaN    0.951100
min       3.070000    1.000000   NaN    NaN  NaN     NaN    1.000000
25%      13.347500    2.000000   NaN    NaN  NaN     NaN    2.000000
50%      17.795000    2.900000   NaN    NaN  NaN     NaN    2.000000
75%      24.127500    3.562500   NaN    NaN  NaN     NaN    3.000000
max      50.810000   10.000000   NaN    NaN  NaN     NaN    6.000000

In [29]:
tip=renamed_tips_data['tip']
tip.mean()

2.9982786885245902

In [30]:
tip.describe()  #12

count    244.000000
mean       2.998279
std        1.383638
min        1.000000
25%        2.000000
50%        2.900000
75%        3.562500
max       10.000000
Name: tip, dtype: float64

In [31]:
sex_grouped_tip=renamed_tips_data['tip'].groupby(renamed_tips_data['sex'])#16
sex_grouped_tip.mean()

sex
Female    2.833448
Male      3.089618
Name: tip, dtype: float64

In [33]:
renamed_tips_data['day'].describe() #23

count     244
unique      4
top       Sat
freq       87
Name: day, dtype: object

In [41]:
day_grouped_data=renamed_tips_data['party size'].groupby(renamed_tips_data['day'])#24
day_grouped_data.sum()

day
Fri      40
Sat     219
Sun     216
Thur    152
Name: party size, dtype: int64

In [39]:
day_grouped_data=renamed_tips_data['tip'].groupby(renamed_tips_data['day'])
day_grouped_data.mean()#26

day
Fri     2.734737
Sat     2.993103
Sun     3.255132
Thur    2.771452
Name: tip, dtype: float64